SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/HAL_Lib/inc/hal_tim.h
/***********************************************************************************************************************
    @file     hal_tim.h
    @author   FD TEAM
    @brief    THIS FILE CONTAINS ALL THE FUNCTIONS PROTOTYPES FOR THE TIM FIRMWARE LIBRARY.
  **********************************************************************************************************************
    @attention

    <h2><center>&copy; Copyright(c) <2023> <MindMotion></center></h2>

      Redistribution and use in source and binary forms, with or without modification, are permitted provided that the
    following conditions are met:
    1. Redistributions of source code must retain the above copyright notice,
       this list of conditions and the following disclaimer.
    2. Redistributions in binary form must reproduce the above copyright notice, this list of conditions and
       the following disclaimer in the documentation and/or other materials provided with the distribution.
    3. Neither the name of the copyright holder nor the names of its contributors may be used to endorse or
       promote products derived from this software without specific prior written permission.

      THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND ANY EXPRESS OR IMPLIED WARRANTIES,
    INCLUDING, BUT NOT LIMITED TO, THE IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
    DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR ANY DIRECT, INDIRECT, INCIDENTAL,
    SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
    SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON ANY THEORY OF LIABILITY,
    WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
    OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *********************************************************************************************************************/


/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __HAL_TIM_H
#define __HAL_TIM_H

/* Files includes ------------------------------------------------------------*/
#include "mm32_device.h"

/** @addtogroup MM32_StdPeriph_Driver
  * @{
  */

/** @defgroup TIM
  * @{
  */

/** @defgroup TIM_Exported_Types
  * @{
  */

/**
  * @brief  TIM Time Base Init structure definition
  */
typedef struct
{
    uint16_t    TIM_Prescaler;         /*!< Specifies the prescaler value used to divide the TIM clock. */
    uint32_t    TIM_CounterMode;       /*!< Specifies the counter mode. */
    uint32_t    TIM_Period;            /*!< Specifies the period value to be loaded into the active */
    uint32_t    TIM_ClockDivision;     /*!< Specifies the clock division. */
    uint8_t     TIM_RepetitionCounter; /*!< Specifies the repetition counter value. Each time the RCR downcounter */
} TIM_TimeBaseInitTypeDef;

/**
  * @brief  TIM Output Compare Init structure definition
  */
typedef struct
{
    uint32_t    TIM_OCMode;       /*!< Specifies the TIM mode. */
    uint32_t    TIM_OutputState;  /*!< Specifies the TIM Output Compare state. */
    uint32_t    TIM_OutputNState; /*!< Specifies the TIM complementary Output Compare state. */
    uint32_t    TIM_Pulse;        /*!< Specifies the pulse value to be loaded into the Capture Compare Register. */
    uint32_t    TIM_OCPolarity;   /*!< Specifies the output polarity. */
    uint32_t    TIM_OCNPolarity;  /*!< Specifies the complementary output polarity. */
    uint32_t    TIM_OCIdleState;  /*!< Specifies the TIM Output Compare pin state during Idle state. */
    uint32_t    TIM_OCNIdleState; /*!< Specifies the TIM Output Compare pin state during Idle state. */
} TIM_OCInitTypeDef;

/**
  * @brief  TIM Input Capture Init structure definition
  */
typedef struct
{
    uint16_t   TIM_Channel;      /*!< Specifies the TIM channel. */
    uint16_t   TIM_ICPolarity;   /*!< Specifies the active edge of the input signal. */
    uint16_t   TIM_ICSelection;  /*!< Specifies the input. */
    uint16_t   TIM_ICPrescaler;  /*!< Specifies the Input Capture Prescaler. */
    uint16_t   TIM_ICFilter;     /*!< Specifies the input capture filter. */
} TIM_ICInitTypeDef;

/**
  * @brief  BDTR structure definition
  * @note   This structure is used only with TIM1 and TIM8.
  */
typedef struct
{
    uint16_t    TIM_OSSRState;       /*!< Specifies the Off-State selection used in Run mode. */
    uint16_t    TIM_OSSIState;       /*!< Specifies the Off-State used in Idle state. */
    uint16_t    TIM_LOCKLevel;       /*!< Specifies the LOCK level parameters. */
    uint16_t    TIM_DeadTime;        /*!< Specifies the delay time between the switching-off and */
    uint16_t    TIM_Break;           /*!< Specifies whether the TIM Break input is enabled or not. */
    uint16_t    TIM_BreakPolarity;   /*!< Specifies the TIM Break Input pin polarity. */
    uint16_t    TIM_AutomaticOutput; /*!< Specifies whether the TIM Automatic Output feature is enabled or not. */
} TIM_BDTRInitTypeDef;

/**
  * @}
  */

/** @defgroup TIM_Exported_Constants
  * @{
  */
/**
  * @brief TIM_Clock_Division_CKD
  */
#define TIM_CKD_Div1       (0x00U << TIM_CR1_CKD_Pos)   /*!< TDTS = Tck_tim */
#define TIM_CKD_Div2       (0x01U << TIM_CR1_CKD_Pos)   /*!< TDTS = 2 * Tck_tim */
#define TIM_CKD_Div4       (0x02U << TIM_CR1_CKD_Pos)   /*!< TDTS = 4 * Tck_tim */

/**
  * @brief TIM_Counter_Mode
  */
#define TIM_CounterMode_Up              (0x00U << TIM_CR1_DIR_Pos)    /*!< TIM Up Counting Mode */
#define TIM_CounterMode_Down            (0x01U << TIM_CR1_DIR_Pos)    /*!< TIM Down Counting Mode */
#define TIM_CounterMode_CenterAligned1  (0x01U << TIM_CR1_CMS_Pos)    /*!< TIM Center Aligned Mode1 */
#define TIM_CounterMode_CenterAligned2  (0x02U << TIM_CR1_CMS_Pos)    /*!< TIM Center Aligned Mode2 */
#define TIM_CounterMode_CenterAligned3  (0x03U << TIM_CR1_CMS_Pos)    /*!< TIM Center Aligned Mode3 */

/**
  * @brief TIM_Prescaler_Reload_Mode
  */
#define TIM_PSCReloadMode_Update       (0x00U << TIM_EGR_UG_Pos)  /*!< The Prescaler is loaded at the update event */
#define TIM_PSCReloadMode_Immediate    (0x01U << TIM_EGR_UG_Pos)  /*!< The Prescaler is loaded immediately */

/**
  * @brief TIM_Output_Compare_and_PWM_modes_and_Forced_Action
  */
#define TIM_OCMode_Timing              0x00U /*!< Output compare mode: Timing */
#define TIM_OCMode_Active              0x01U /*!< Output compare mode: Active */
#define TIM_OCMode_Inactive            0x02U /*!< Output compare mode: Inactive */
#define TIM_OCMode_Toggle              0x03U /*!< Output compare mode: Toggle */
#define TIM_ForcedAction_InActive      0x04U /*!< Force inactive level on OCnREF */
#define TIM_ForcedAction_Active        0x05U /*!< Force active level on OCnREF */
#define TIM_OCMode_PWM1                0x06U /*!< Output compare mode: PWM1 */
#define TIM_OCMode_PWM2                0x07U /*!< Output compare mode: PWM2 */

/**
  * @brief TIM_Output_Compare_Polarity
  */
#define TIM_OCPolarity_High            0x00U /*!< Output Compare active high */
#define TIM_OCPolarity_Low             0x01U /*!< Output Compare active low */

/**
  * @brief TIM_Output_Compare_N_Polarity
  */
#define TIM_OCNPolarity_High           0x00U /*!< Output Compare active high */
#define TIM_OCNPolarity_Low            0x01U /*!< Output Compare active low */

/**
  * @brief TIM_Output_Compare_state
  */
#define TIM_OutputState_Disable        0x00U /*!< Output Compare Disable */
#define TIM_OutputState_Enable         0x01U /*!< Output Compare Enable */

/**
  * @brief TIM_Output_Compare_N_state
  */
#define TIM_OutputNState_Disable       0x00U /*!< Output Compare N Disable */
#define TIM_OutputNState_Enable        0x01U /*!< Output Compare N Enable */

/**
  * @brief TIM_Output_Compare_Idle_State
  */
#define TIM_OCIdleState_Reset          0x00U /*!< OCn=0 (after a dead-time if OCnN is implemented) when MOE=0.(n= 0 : 4) */
#define TIM_OCIdleState_Set            0x01U /*!< OCn=1 (after a dead-time if OCnN is implemented) when MOE=0.(n= 0 : 4) */


/**
  * @brief TIM_Output_Compare_N_Idle_State
  */
#define TIM_OCNIdleState_Reset         0x00U  /*!< OCnN=0 after a dead-time when MOE=0.(n= 0 : 4) */
#define TIM_OCNIdleState_Set           0x01U  /*!< OCnN=1 after a dead-time when MOE=0.(n= 0 : 4) */

/**
  * @brief TIM_Channel
  */
#define TIM_Channel_1                 0x0000  /*!< TIM Channel 1 */
#define TIM_Channel_2                 0x0004  /*!< TIM Channel 2 */
#define TIM_Channel_3                 0x0008  /*!< TIM Channel 3 */
#define TIM_Channel_4                 0x000C  /*!< TIM Channel 4 */

/**
  * @brief TIM_Input_Capture_Polarity
  */
#define TIM_ICPolarity_Rising      (0x00 << TIM_CCER_CC1P_Pos)  /*!< IC Rising edge */
#define TIM_ICPolarity_Falling     (0x01 << TIM_CCER_CC1P_Pos)  /*!< IC Falling edge */
#define TIM_ICPolarity_BothEdge    ((0x01 << TIM_CCER_CC1P_Pos) | (0x01 << TIM_CCER_CC1NP_Pos))

/**
  * @brief TIM_Input_Capture_Selection
  */
#define TIM_ICSelection_DirectTI     0x01U
#define TIM_ICSelection_IndirectTI   0x02U
#define TIM_ICSelection_TRC          0x03U  

/**
  * @brief TIM_Input_Capture_Prescaler
  */
#define TIM_ICPSC_Div1               0x0000 /*!< no prescaler */
#define TIM_ICPSC_Div2               0x0004 /*!< capture is done once every 2 events */
#define TIM_ICPSC_Div4               0x0008 /*!< capture is done once every 4 events */
#define TIM_ICPSC_Div8               0x000C /*!< capture is done once every 8 events */

/**
  * @brief OSSR_Off_State_Selection_for_Run_mode_state
  */
#define TIM_OSSRState_Disable        (0x00U << TIM_BDTR_OSSR_Pos)
#define TIM_OSSRState_Enable         (0x01U << TIM_BDTR_OSSR_Pos)

/**
  * @brief OSSI_Off_State_Selection_for_Idle_mode_state
  */
#define TIM_OSSIState_Disable        (0x00U << TIM_BDTR_OSSI_Pos)
#define TIM_OSSIState_Enable         (0x01U << TIM_BDTR_OSSI_Pos)

/**
  * @brief Lock_level
  */
#define TIM_LOCKLevel_OFF             (0x00U << TIM_BDTR_LOCK_Pos)  
#define TIM_LOCKLevel_1               (0x01U << TIM_BDTR_LOCK_Pos)  
#define TIM_LOCKLevel_2               (0x02U << TIM_BDTR_LOCK_Pos)  
#define TIM_LOCKLevel_3               (0x03U << TIM_BDTR_LOCK_Pos)  

/**
  * @brief Break_Input_enable_disable
  */
#define TIM_Break_Disable             (0x00U << TIM_BDTR_BKE_Pos)/*!< Break inputs (BRK and CSS clock failure event) disabled */
#define TIM_Break_Enable              (0x01U << TIM_BDTR_BKE_Pos)/*!< Break inputs (BRK and CSS clock failure event) enabled */

/**
  * @brief Break_Polarity
  */
#define TIM_BreakPolarity_Low         (0x00U << TIM_BDTR_BKP_Pos) /*!< Break input BRK is active low */
#define TIM_BreakPolarity_High        (0x01U << TIM_BDTR_BKP_Pos) /*!< Break input BRK is active high */

/**
  * @brief TIM_AOE_Bit_Set_Reset
  */
#define TIM_AutomaticOutput_Disable   (0x00U << TIM_BDTR_AOE_Pos)  /*!< MOE can be set only by software. */
#define TIM_AutomaticOutput_Enable    (0x01U << TIM_BDTR_AOE_Pos)  /*!< MOE can be set by software or automatically at the next
                                                                    update event (if the break input is not be active). */
/**
  * @brief TIM_DOE_Bit_Set_Reset
  */
#define TIM_DirectOutput_Disable      (0x00U << TIM_BDTR_DOE_Pos)  /*!< Direct output disable, output waiting for dead time */
#define TIM_DirectOutput_Enable       (0x01U << TIM_BDTR_DOE_Pos)  /*!< Direct output enable, no longer waiting for output after dead time */

/**
  * @brief TIM_interrupt_sources
  */
#define TIM_IT_Update                 (0x01U << TIM_DIER_UIE_Pos)      /*!< TIM update Interrupt source */
#define TIM_IT_CC1                    (0x01U << TIM_DIER_CC1IE_Pos)    /*!< TIM Capture Compare 1 Interrupt source */
#define TIM_IT_CC2                    (0x01U << TIM_DIER_CC2IE_Pos)    /*!< TIM Capture Compare 2 Interrupt source */
#define TIM_IT_CC3                    (0x01U << TIM_DIER_CC3IE_Pos)    /*!< TIM Capture Compare 3 Interrupt source */
#define TIM_IT_CC4                    (0x01U << TIM_DIER_CC4IE_Pos)    /*!< TIM Capture Compare 4 Interrupt source */
#define TIM_IT_COM                    (0x01U << TIM_DIER_COMIE_Pos)    /*!< TIM Commutation Interrupt source */
#define TIM_IT_Trigger                (0x01U << TIM_DIER_TIE_Pos)      /*!< TIM Trigger Interrupt source */
#define TIM_IT_Break                  (0x01U << TIM_DIER_BIE_Pos)      /*!< TIM Break Interrupt source */
#define TIM_IT_CC5                    (0x01U << TIM_DIER_CC5IE_Pos)    /*!< TIM Capture Compare 5 Interrupt source */
#define TIM_IT_CC6                    (0x01U << TIM_DIER_CC6IE_Pos)    /*!< TIM Capture Compare 6 Interrupt source */

/**
  * @brief TIM_Event_Source
  */
#define TIM_EventSource_Update        (0x01U << TIM_EGR_UG_Pos)      /*!< Timer update Event source */
#define TIM_EventSource_CC1           (0x01U << TIM_EGR_CC1G_Pos)    /*!< Timer Capture Compare 1 Event source */
#define TIM_EventSource_CC2           (0x01U << TIM_EGR_CC2G_Pos)    /*!< Timer Capture Compare 2 Event source */
#define TIM_EventSource_CC3           (0x01U << TIM_EGR_CC3G_Pos)    /*!< Timer Capture Compare 3 Event source */
#define TIM_EventSource_CC4           (0x01U << TIM_EGR_CC4G_Pos)    /*!< Timer Capture Compare 4 Event source */
#define TIM_EventSource_COM           (0x01U << TIM_EGR_COMG_Pos)    /*!< Timer COM event source */
#define TIM_EventSource_Trigger       (0x01U << TIM_EGR_TG_Pos)      /*!< Timer Trigger Event source */
#define TIM_EventSource_Break         (0x01U << TIM_EGR_BG_Pos)      /*!< Timer Break event source */
#define TIM_EventSource_CC5           (0x01U << TIM_EGR_CC5G_Pos)    /*!< Timer Capture Compare 5 Event source */
#define TIM_EventSource_CC6           (0x01U << TIM_EGR_CC6G_Pos)    /*!< Timer Capture Compare 6 Event source */

/**
  * @brief TIM_DMA_sources
  */
#define TIM_DMA_Update                (0x01U << TIM_DIER_UDE_Pos)     /*!< TIM update Interrupt source */
#define TIM_DMA_CC1                   (0x01U << TIM_DIER_CC1DE_Pos)   /*!< TIM Capture Compare 1 DMA source */
#define TIM_DMA_CC2                   (0x01U << TIM_DIER_CC2DE_Pos)   /*!< TIM Capture Compare 2 DMA source */
#define TIM_DMA_CC3                   (0x01U << TIM_DIER_CC3DE_Pos)   /*!< TIM Capture Compare 3 DMA source */
#define TIM_DMA_CC4                   (0x01U << TIM_DIER_CC4DE_Pos)   /*!< TIM Capture Compare 4 DMA source */
#define TIM_DMA_COM                   (0x01U << TIM_DIER_COMDE_Pos)   /*!< TIM Commutation DMA source */
#define TIM_DMA_Trigger               (0x01U << TIM_DIER_TDE_Pos)     /*!< TIM Trigger DMA source */
#define TIM_DMA_CC5                   (0x01U << TIM_DIER_CC5DE_Pos)   /*!< TIM Capture Compare 5 DMA source */
#define TIM_DMA_CC6                   (0x01U << TIM_DIER_CC6DE_Pos)   /*!< TIM Capture Compare 6 DMA source */

/**
  * @brief TIM_DMA_Base_address
  */
#define TIM_DMABase_CR1               0x0000
#define TIM_DMABase_CR2               0x0001
#define TIM_DMABase_SMCR              0x0002
#define TIM_DMABase_DIER              0x0003
#define TIM_DMABase_SR                0x0004
#define TIM_DMABase_EGR               0x0005
#define TIM_DMABase_CCMR1             0x0006
#define TIM_DMABase_CCMR2             0x0007
#define TIM_DMABase_CCER              0x0008
#define TIM_DMABase_CNT               0x0009
#define TIM_DMABase_PSC               0x000A
#define TIM_DMABase_ARR               0x000B
#define TIM_DMABase_RCR               0x000C
#define TIM_DMABase_CCR1              0x000D
#define TIM_DMABase_CCR2              0x000E
#define TIM_DMABase_CCR3              0x000F
#define TIM_DMABase_CCR4              0x0010
#define TIM_DMABase_BDTR              0x0011
#define TIM_DMABase_DCR               0x0012

/**
  * @brief TIM_DMA_Burst_Length
  */
#define TIM_DMABurstLength_1Byte      0x0000
#define TIM_DMABurstLength_2Bytes     0x0100
#define TIM_DMABurstLength_3Bytes     0x0200
#define TIM_DMABurstLength_4Bytes     0x0300
#define TIM_DMABurstLength_5Bytes     0x0400
#define TIM_DMABurstLength_6Bytes     0x0500
#define TIM_DMABurstLength_7Bytes     0x0600
#define TIM_DMABurstLength_8Bytes     0x0700
#define TIM_DMABurstLength_9Bytes     0x0800
#define TIM_DMABurstLength_10Bytes    0x0900
#define TIM_DMABurstLength_11Bytes    0x0A00
#define TIM_DMABurstLength_12Bytes    0x0B00
#define TIM_DMABurstLength_13Bytes    0x0C00
#define TIM_DMABurstLength_14Bytes    0x0D00
#define TIM_DMABurstLength_15Bytes    0x0E00
#define TIM_DMABurstLength_16Bytes    0x0F00
#define TIM_DMABurstLength_17Bytes    0x1000
#define TIM_DMABurstLength_18Bytes    0x1100

/**
  * @brief TIM_Internal_Trigger_Selection
  */
#define TIM_TS_ITR0             ((0x00U << TIM_SMCR_TS_H_Pos) | (0x00U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 0 */
#define TIM_TS_ITR1             ((0x00U << TIM_SMCR_TS_H_Pos) | (0x01U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 1 */
#define TIM_TS_ITR2             ((0x00U << TIM_SMCR_TS_H_Pos) | (0x02U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 2 */
#define TIM_TS_ITR3             ((0x00U << TIM_SMCR_TS_H_Pos) | (0x03U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 3 */
#define TIM_TS_TI1F_ED          ((0x00U << TIM_SMCR_TS_H_Pos) | (0x04U << TIM_SMCR_TS_L_Pos))  /*!< TI1 Edge Detector */
#define TIM_TS_TI1FP1           ((0x00U << TIM_SMCR_TS_H_Pos) | (0x05U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 1 */
#define TIM_TS_TI2FP2           ((0x00U << TIM_SMCR_TS_H_Pos) | (0x06U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 2 */
#define TIM_TS_ETRF             ((0x00U << TIM_SMCR_TS_H_Pos) | (0x07U << TIM_SMCR_TS_L_Pos))  /*!< External Trigger */
#define TIM_TS_ITR4             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x00U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 4 */
#define TIM_TS_ITR5             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x01U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 5 */
#define TIM_TS_ITR6             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x02U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 6 */
#define TIM_TS_ITR7             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x03U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 7 */
#define TIM_TS_ITR8             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x04U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 8 */
#define TIM_TS_ITR9             ((0x01U << TIM_SMCR_TS_H_Pos) | (0x05U << TIM_SMCR_TS_L_Pos))  /*!< Internal Trigger 9 */
#define TIM_TS_TI1FP3           ((0x02U << TIM_SMCR_TS_H_Pos) | (0x04U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 3 */
#define TIM_TS_TI2FP4           ((0x02U << TIM_SMCR_TS_H_Pos) | (0x05U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 4 */

/**
  * @brief TIM_TIx_External_Clock_Source
  */
#define TIM_TIxExternalCLK1Source_TI1     ((0x00U << TIM_SMCR_TS_H_Pos) | (0x05U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 1 */
#define TIM_TIxExternalCLK1Source_TI2     ((0x00U << TIM_SMCR_TS_H_Pos) | (0x06U << TIM_SMCR_TS_L_Pos))  /*!< Filtered Timer Input 2 */
#define TIM_TIxExternalCLK1Source_TI1ED   ((0x00U << TIM_SMCR_TS_H_Pos) | (0x04U << TIM_SMCR_TS_L_Pos))  /*!< TI1 Edge Detector */

/**
  * @brief TIM_External_Trigger_Prescaler
  */
#define TIM_ExtTRGPSC_OFF                 (0x00U << TIM_SMCR_ETPS_Pos) /*!< ETRP Prescaler OFF */
#define TIM_ExtTRGPSC_Div2                (0x01U << TIM_SMCR_ETPS_Pos) /*!< ETRP frequency divided by 2 */
#define TIM_ExtTRGPSC_Div4                (0x02U << TIM_SMCR_ETPS_Pos) /*!< ETRP frequency divided by 4 */
#define TIM_ExtTRGPSC_Div8                (0x03U << TIM_SMCR_ETPS_Pos) /*!< ETRP frequency divided by 8 */

/**
  * @brief TIM_External_Trigger_Polarity
  */
#define TIM_ExtTRGPolarity_NonInverted   (0x00U << TIM_SMCR_ETP_Pos) /*!< Active high or rising edge active */
#define TIM_ExtTRGPolarity_Inverted      (0x01U << TIM_SMCR_ETP_Pos) /*!< Active low or falling edge active */

/**
  * @brief TIM_Encoder_Mode
  */
#define TIM_EncoderMode_TI1              (0x01U << TIM_SMCR_SMS_Pos) /*!< Counter counts on TI1FP1 edge depending on TI2FP2 level. */
#define TIM_EncoderMode_TI2              (0x02U << TIM_SMCR_SMS_Pos) /*!< Counter counts on TI2FP2 edge depending on TI1FP1 level. */
#define TIM_EncoderMode_TI12             (0x03U << TIM_SMCR_SMS_Pos) /*!< Counter counts on both TI1FP1 and TI2FP2 edges depending
                                                                      on the level of the other input. */

#define TIM_CCMR1_CC1S_OC               (0x00U << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC1S_DIRECTTI         (0x01U << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC1S_INDIRECTTI       (0x02U << TIM_CCMR1_CC1S_Pos)
#define TIM_CCMR1_CC1S_TRC              (0x03U << TIM_CCMR1_CC1S_Pos)

