SkydiverMCU/mcu-iap-demo/Cortex-M0+/MM32SPIN0260/MM32SPIN0260_Application/Device/MM32SPIN0260/HAL_Lib/inc/hal_tim.h
#define TIM_CCMR1_CC2S_OC               (0x00U << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR1_CC2S_DIRECTTI         (0x01U << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR1_CC2S_INDIRECTTI       (0x02U << TIM_CCMR1_CC2S_Pos)
#define TIM_CCMR1_CC2S_TRC              (0x03U << TIM_CCMR1_CC2S_Pos)

/**
  * @brief TIM_Output_Compare_Preload_State
  */
#define TIM_OCPreload_Disable           (0x00U << TIM_CCMR1_OC1PE_Pos)  /*!< TIM output compare preload disable */
#define TIM_OCPreload_Enable            (0x01U << TIM_CCMR1_OC1PE_Pos)  /*!< TIM output compare preload enable */

/**
  * @brief TIM_Output_Compare_Clear_State
  */
#define TIM_OCClear_Disable              (0x01U << TIM_CCMR1_OC1CE_Pos) /*!< TIM Output clear disable */
#define TIM_OCClear_Enable               (0x01U << TIM_CCMR1_OC1CE_Pos) /*!< TIM Output clear enable */

/**
  * @brief TIM_Output_Compare_Fast_State
  */
#define TIM_OCFast_Disable               (0x01U << TIM_CCMR1_OC1FE_Pos) /*!< TIM output compare fast disable */
#define TIM_OCFast_Enable                (0x01U << TIM_CCMR1_OC1FE_Pos) /*!< TIM output compare fast enable */

/**
  * @brief TIM_Capture_Compare_state
  */
#define TIM_CCx_Disable                  (0x00U << TIM_CCER_CC1E_Pos)   /*!< Capture/Compare Enable */
#define TIM_CCx_Enable                   (0x01U << TIM_CCER_CC1E_Pos)   /*!< Capture/Compare Enable */

/**
  * @brief TIM_Capture_Compare_N_state
  */
#define TIM_CCxN_Disable                 (0x00U << TIM_CCER_CC1NE_Pos)  /*!< Capture/Compare N Enable */
#define TIM_CCxN_Enable                  (0x01U << TIM_CCER_CC1NE_Pos)  /*!< Capture/Compare N Enable */

/**
  * @brief TIM_Update_Source
  */
#define TIM_UpdateSource_Global          (0x00U << TIM_CR1_URS_Pos)    /*!< Source of update is counter overflow/underflow. */
#define TIM_UpdateSource_Regular         (0x01U << TIM_CR1_URS_Pos)    /*!< Source of update is the counter overflow/underflow
                                                                       or the setting of UG bit, or an update generation
                                                                       through the slave mode controller. */

/**
  * @brief TIM_One_Pulse_Mode
  */
#define TIM_OPMode_Repetitive            (0x00U << TIM_CR1_OPM_Pos) /*!< Counter is not stopped at update event */
#define TIM_OPMode_Single                (0x01U << TIM_CR1_OPM_Pos) /*!< Counter stops counting at the next update event (clearing the bit CEN) */

/**
  * @brief TIM_Trigger_Output_Source
  */
#define TIM_TRIGSource_Reset             (0x00U << TIM_CR2_MMS_Pos) /*!< The UG bit in the TIM_EGR register is used as the trigger output (TRIG). */
#define TIM_TRIGSource_Enable            (0x01U << TIM_CR2_MMS_Pos) /*!< The Counter Enable CEN is used as the trigger output (TRIG). */
#define TIM_TRIGSource_Update            (0x02U << TIM_CR2_MMS_Pos) /*!< The update event is used as the trigger output (TRIG). */
#define TIM_TRIGSource_OC1               (0x03U << TIM_CR2_MMS_Pos) /*!< The trigger output sends a positive pulse when the CC1IF flag */
#define TIM_TRIGSource_OC1Ref            (0x04U << TIM_CR2_MMS_Pos) /*!< OC1REF signal is used as the trigger output (TRIG). */
#define TIM_TRIGSource_OC2Ref            (0x05U << TIM_CR2_MMS_Pos) /*!< OC2REF signal is used as the trigger output (TRIG). */
#define TIM_TRIGSource_OC3Ref            (0x06U << TIM_CR2_MMS_Pos) /*!< OC3REF signal is used as the trigger output (TRIG). */
#define TIM_TRIGSource_OC4Ref            (0x07U << TIM_CR2_MMS_Pos) /*!< OC4REF signal is used as the trigger output (TRIG). */

/**
  * @brief TIM_Slave_Mode
  */
#define TIM_SlaveMode_Reset              (0x04U << TIM_SMCR_SMS_Pos) /*!< Rising edge of the selected trigger signal (TRGI) re-initializes */
#define TIM_SlaveMode_Gated              (0x05U << TIM_SMCR_SMS_Pos) /*!< The counter clock is enabled when the trigger signal (TRGI) is high. */
#define TIM_SlaveMode_Trigger            (0x06U << TIM_SMCR_SMS_Pos) /*!< The counter starts at a rising edge of the trigger TRGI. */
#define TIM_SlaveMode_External1          (0x07U << TIM_SMCR_SMS_Pos) /*!< Rising edges of the selected trigger (TRGI) clock the counter. */

/**
  * @brief TIM_Master_Slave_Mode
  */
#define TIM_MasterSlaveMode_Disable      (0x00U << TIM_SMCR_MSM_Pos) /*!< No action */
#define TIM_MasterSlaveMode_Enable       (0x01U << TIM_SMCR_MSM_Pos) /*!< synchronization between the current timer and its slaves (through TRIG) */

/**
  * @brief TIM_Flags
  */
#define TIM_FLAG_Update                  (0x01U << TIM_SR_UIF_Pos)      /*!< TIM update Flag */
#define TIM_FLAG_CC1                     (0x01U << TIM_SR_CC1IF_Pos)    /*!< TIM Capture Compare 1 Flag */
#define TIM_FLAG_CC2                     (0x01U << TIM_SR_CC2IF_Pos)    /*!< TIM Capture Compare 2 Flag */
#define TIM_FLAG_CC3                     (0x01U << TIM_SR_CC3IF_Pos)    /*!< TIM Capture Compare 3 Flag */
#define TIM_FLAG_CC4                     (0x01U << TIM_SR_CC4IF_Pos)    /*!< TIM Capture Compare 4 Flag */
#define TIM_FLAG_COM                     (0x01U << TIM_SR_COMIF_Pos)    /*!< TIM Commutation Flag */
#define TIM_FLAG_Trigger                 (0x01U << TIM_SR_TIF_Pos)      /*!< TIM Trigger Flag */
#define TIM_FLAG_Break                   (0x01U << TIM_SR_BIF_Pos)      /*!< TIM Break Flag */
#define TIM_FLAG_CC1OF                   (0x01U << TIM_SR_CC1OF_Pos)    /*!< TIM Capture Compare 1 overcapture Flag */
#define TIM_FLAG_CC2OF                   (0x01U << TIM_SR_CC2OF_Pos)    /*!< TIM Capture Compare 2 overcapture Flag */
#define TIM_FLAG_CC3OF                   (0x01U << TIM_SR_CC3OF_Pos)    /*!< TIM Capture Compare 3 overcapture Flag */
#define TIM_FLAG_CC4OF                   (0x01U << TIM_SR_CC4OF_Pos)    /*!< TIM Capture Compare 4 overcapture Flag */
#define TIM_FLAG_CC5                     (0x01U << TIM_SR_CC5IF_Pos)    /*!< TIM Capture Compare 5 Flag */
#define TIM_FLAG_CC6                     (0x01U << TIM_SR_CC6IF_Pos)    /*!< TIM Capture Compare 6 Flag */

/**
  * @brief PWM phase shift and DMA repeat update
  */
#define TIM_PDER_CCDREPE_EN              (0x01U << TIM_PDER_CCDREPE_Pos)          /*!< TIM DMA reqeat enable bit */
#define TIM_PDER_CCR1SHIFTEN             (0x01U << TIM_PDER_CCR1_SHIFT_EN_Pos)    /*!< TIM Channel 1 output PWM phase shift enable bit */
#define TIM_PDER_CCR2SHIFTEN             (0x01U << TIM_PDER_CCR2_SHIFT_EN_Pos)    /*!< TIM Channel 2 output PWM phase shift enable bit */
#define TIM_PDER_CCR3SHIFTEN             (0x01U << TIM_PDER_CCR3_SHIFT_EN_Pos)    /*!< TIM Channel 3 output PWM phase shift enable bit */
#define TIM_PDER_CCR4SHIFTEN             (0x01U << TIM_PDER_CCR4_SHIFT_EN_Pos)    /*!< TIM Channel 4 output PWM phase shift enable bit */
#define TIM_PDER_CCR5SHIFTEN             (0x01U << TIM_PDER_CCR5_SHIFT_EN_Pos)    /*!< TIM Channel 5 output PWM phase shift enable bit */
#define TIM_PDER_CCR6SHIFTEN             (0x01U << TIM_PDER_CCR6_SHIFT_EN_Pos)    /*!< TIM Channel 6 output PWM phase shift enable bit */
#define TIM_PDER_CCR1WINDOWEN            (0x01U << TIM_PDER_CCR1_WINDOW_EN_Pos)   /*!< TIM Channel 1 output PWM window enable bit */
#define TIM_PDER_CCR2WINDOWEN            (0x01U << TIM_PDER_CCR2_WINDOW_EN_Pos)   /*!< TIM Channel 2 output PWM window enable bit */
#define TIM_PDER_CCR3WINDOWEN            (0x01U << TIM_PDER_CCR3_WINDOW_EN_Pos)   /*!< TIM Channel 3 output PWM window enable bit */
#define TIM_PDER_CCR4WINDOWEN            (0x01U << TIM_PDER_CCR4_WINDOW_EN_Pos)   /*!< TIM Channel 4 output PWM window enable bit */
#define TIM_PDER_CCR5WINDOWEN            (0x01U << TIM_PDER_CCR5_WINDOW_EN_Pos)   /*!< TIM Channel 5 output PWM window enable bit */
#define TIM_PDER_CCR6WINDOWEN            (0x01U << TIM_PDER_CCR6_WINDOW_EN_Pos)   /*!< TIM Channel 6 output PWM window enable bit */


/**
  * @brief Break input filter
  */  
#define TIM_BKINF_2               (0x00U << TIM_BKINF_BKINF_Pos)     /*!< 2 cycles */
#define TIM_BKINF_4               (0x01U << TIM_BKINF_BKINF_Pos)     /*!< 4 cycles */
#define TIM_BKINF_8               (0x02U << TIM_BKINF_BKINF_Pos)     /*!< 8 cycles */
#define TIM_BKINF_16              (0x03U << TIM_BKINF_BKINF_Pos)     /*!< 16 cycles */
#define TIM_BKINF_32              (0x04U << TIM_BKINF_BKINF_Pos)     /*!< 32 cycles */
#define TIM_BKINF_64              (0x05U << TIM_BKINF_BKINF_Pos)     /*!< 64 cycles */
#define TIM_BKINF_128             (0x06U << TIM_BKINF_BKINF_Pos)     /*!< 128 cycles */
#define TIM_BKINF_256             (0x07U << TIM_BKINF_BKINF_Pos)     /*!< 256 cycles */
#define TIM_BKINF_384             (0x08U << TIM_BKINF_BKINF_Pos)     /*!< 384 cycles */
#define TIM_BKINF_512             (0x09U << TIM_BKINF_BKINF_Pos)     /*!< 512 cycles */
#define TIM_BKINF_640             (0x0AU << TIM_BKINF_BKINF_Pos)     /*!< 640 cycles */
#define TIM_BKINF_768             (0x0BU << TIM_BKINF_BKINF_Pos)     /*!< 768 cycles */
#define TIM_BKINF_896             (0x0CU << TIM_BKINF_BKINF_Pos)     /*!< 896 cycles */
#define TIM_BKINF_1024            (0x0DU << TIM_BKINF_BKINF_Pos)     /*!< 1024 cycles */
#define TIM_BKINF_1152            (0x0EU << TIM_BKINF_BKINF_Pos)     /*!< 1152 cycles */
#define TIM_BKINF_1280            (0x0FU << TIM_BKINF_BKINF_Pos)     /*!< 1280 cycles */

/**
  * @brief TIM break input sel
  */  
#define TIM_CSSBKIN_CSS       (0x01U << TIM_BKINF_CSSBKIN_SEL_Pos)   /*!< CSS(TIM1) break input sel */

#define TIM1_IOBKIN_BKIN1      ((0x01U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN2      ((0x02U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN3      ((0x04U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN4      ((0x08U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN5      ((0x10U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN6      ((0x20U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN7      ((0x40U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x00U << TIM_BKINF_IOBKIN_SEL_H_Pos))  
#define TIM1_IOBKIN_BKIN8      ((0x00U << TIM_BKINF_IOBKIN_SEL_L_Pos) | (0x01U << TIM_BKINF_IOBKIN_SEL_H_Pos))  

#define TIM16_IOBKIN_BKIN1      (0x01U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM16_IOBKIN_BKIN2      (0x02U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM16_IOBKIN_BKIN3      (0x04U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM16_IOBKIN_BKIN4      (0x08U << TIM_BKINF_IOBKIN_SEL_L_Pos)

#define TIM17_IOBKIN_BKIN1      (0x01U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM17_IOBKIN_BKIN2      (0x02U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM17_IOBKIN_BKIN3      (0x04U << TIM_BKINF_IOBKIN_SEL_L_Pos)
#define TIM17_IOBKIN_BKIN4      (0x08U << TIM_BKINF_IOBKIN_SEL_L_Pos)

#define TIM1_COMPBKIN_COMP1     (0x01U << TIM_BKINF_COMPBKIN_SEL_Pos)  
#define TIM1_COMPBKIN_COMP2     (0x02U << TIM_BKINF_COMPBKIN_SEL_Pos)  

#define TIM16_COMPBKIN_COMP1    (0x10U << TIM_BKINF_IOBKIN_SEL_L_Pos)  
#define TIM16_COMPBKIN_COMP2    (0x20U << TIM_BKINF_IOBKIN_SEL_L_Pos)

#define TIM17_COMPBKIN_COMP1    (0x10U << TIM_BKINF_IOBKIN_SEL_L_Pos)  
#define TIM17_COMPBKIN_COMP2    (0x20U << TIM_BKINF_IOBKIN_SEL_L_Pos)

/**
  * @brief TIM brake Flags
  */
#define TIM_FLAG_CMPBF2         (0x01U << TIM_BKSR_BCPTF2_Pos)
#define TIM_FLAG_CMPBF1         (0x01U << TIM_BKSR_BCPTF1_Pos)
#define TIM_FLAG_IOBF           (0x01U << TIM_BKSR_IOBF_Pos)
#define TIM_FLAG_CSSBF          (0x01U << TIM_BKSR_CSSBF_Pos)

/**
  * @brief TIM ETR remap sel
  */  
#define TIM_ETR_RMP_GPIOInputOrCOMPInput     (0x00U << TIM_OR_ETR_RMP_Pos)   /*!< ETR GPIO input or COMP input */
#define TIM_ETR_RMP_LSIInput                 (0x01U << TIM_OR_ETR_RMP_Pos)   /*!< LSI clock input */
#define TIM_ETR_RMP_HSE_CLK_D128             (0x03U << TIM_OR_ETR_RMP_Pos)   /*!< HSE_CLK_D128 clock input */

/**
  * @brief TIM TI4 remap sel
  */  
#define TIM_TI4_RMP_GPIOInputOrCOMPInput     (0x00U << TIM_OR_TI4_RMP_Pos)   /*!< CH4 GPIO input */
#define TIM_TI4_RMP_LSIInput                 (0x01U << TIM_OR_TI4_RMP_Pos)   /*!< LSI clock input */
#define TIM_TI4_RMP_HSE_CLK_D128             (0x03U << TIM_OR_TI4_RMP_Pos)   /*!< HSE_CLK_D128 clock input */

/**
  * @brief TIM output compare clear select
  */  
#define TIM_OCRefClear_ExtTrigger           (0x00U << TIM_SMCR_OCCS_Pos)   /*!< External trigger signal */
#define TIM_OCRefClear_COMPOutput           (0x01U << TIM_SMCR_OCCS_Pos)   /*!< COMP output signal */

/**
  * @brief TIM debug output mode
  */  
#define TIM_DebugOutput_Hold          (0x00U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN maintains the output value before entering the debug mode */
#define TIM_DebugOutput_Low           (0x01U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN output low level */
#define TIM_DebugOutput_Opposite      (0x02U << TIM_DOCR_DOS_Pos)   /*!< OCx output high level, OCxN output low level. */
#define TIM_DebugOutput_Same          (0x04U << TIM_DOCR_DOS_Pos)   /*!< OCx output high level, OCxN output high level. */
#define TIM_DebugOutput_BreakSet      (0x05U << TIM_DOCR_DOS_Pos)   /*!< OCx/OCxN output the level set by the brake function. */

/**
  * @brief TIM soft output channel
  */
#define TIM_SoftChannel_OC1     0x01   /*!< OC1  as the software output channel */
#define TIM_SoftChannel_OC1N    0x02   /*!< OC1N as the software output channel */
#define TIM_SoftChannel_OC2     0x04   /*!< OC2  as the software output channel */
#define TIM_SoftChannel_OC2N    0x08   /*!< OC2N as the software output channel */
#define TIM_SoftChannel_OC3     0x10   /*!< OC3  as the software output channel */
#define TIM_SoftChannel_OC3N    0x20   /*!< OC3N as the software output channel */
#define TIM_SoftChannel_OC4     0x40   /*!< OC4  as the software output channel */
#define TIM_SoftChannel_OC4N    0x80   /*!< OC4N as the software output channel */

/**
  * @brief TIM soft output value
  */
#define TIM_SoftOutput_Low      0x00    /*!< OCx/OCxN software set output 0 */
#define TIM_SoftOutput_High     0x01    /*!< OCx/OCxN Software set output 1 */

/**
  * @brief TIM Break Flags
  */
#define TIM_BreakFlag_CMP2             (0x01U << TIM_BKSR_BCPTF2_Pos) /*!< TIM CMP2 Break Flag */
#define TIM_BreakFlag_CMP1             (0x01U << TIM_BKSR_BCPTF1_Pos) /*!< TIM CMP1 Break Flag */
#define TIM_BreakFlag_IO               (0x01U << TIM_BKSR_IOBF_Pos)   /*!< TIM IO Break Flag   */
#define TIM_BreakFlag_CSS              (0x01U << TIM_BKSR_CSSBF_Pos)  /*!< TIM CSS Break Flag  */

/**
  * @}
  */

/** @defgroup TIM_Exported_Functions
  * @{
  */
void TIM_DeInit(TIM_TypeDef *tim);

void TIM_TimeBaseStructInit(TIM_TimeBaseInitTypeDef *init_struct);
void TIM_TimeBaseInit(TIM_TypeDef *tim, TIM_TimeBaseInitTypeDef *init_struct);

